#include "init.h"

void Init_INT0()// 外部中断0
{
    IT0 = 1;// 信号类型(1为下降沿触发，0为高电平触发)
    EX0 = 1;// int0开关
    EA = 1;// 总开关
}
void Init_INT1()// 外部中断1
{
    IT1 = 1;// 信号类型(1为下降沿触发，0为高电平触发)
    EX1 = 1;// int1开关
    EA = 1;// 总开关
}
void Init_Timer0() {
    TMOD |= 0x01 << 0;// 工作方式 1
    TH0 = (65536 - 1000) >> 256;// 高 8
    TL0 = (char)(65536 - 1000); // 低 8
    EA = 1;// 总中断
    ET0 = 1;// 定时器 0 中断开关
    PT0 = 1;// 优先级高
    TR0 = 1;// 启动定时器 0
}
void Init_Timer1() {
    TMOD |= 0x01 << 4;// 工作方式 1
    TH1 = (65536 - 1000) >> 256;// 高 8
    TL1 = (char)(65536 - 1000); // 低 8
    EA = 1;// 总中断
    ET1 = 1;// 定时器 1 中断开关
    PT1 = 0;// 优先级低
    TR1 = 1;// 启动定时器1
} 

